SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_amuxcp.h
/* Bit fields for AMUXCP TRIM */
#define _AMUXCP_TRIM_RESETVALUE                 0x77E44AB1UL                            /**< Default value for AMUXCP_TRIM               */
#define _AMUXCP_TRIM_MASK                       0x77FFEFFFUL                            /**< Mask for AMUXCP_TRIM                        */
#define _AMUXCP_TRIM_WARMUPTIME_SHIFT           0                                       /**< Shift value for AMUXCP_WARMUPTIME           */
#define _AMUXCP_TRIM_WARMUPTIME_MASK            0x3UL                                   /**< Bit mask for AMUXCP_WARMUPTIME              */
#define _AMUXCP_TRIM_WARMUPTIME_DEFAULT         0x00000001UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define _AMUXCP_TRIM_WARMUPTIME_WUCYCLES72      0x00000000UL                            /**< Mode WUCYCLES72 for AMUXCP_TRIM             */
#define _AMUXCP_TRIM_WARMUPTIME_WUCYCLES96      0x00000001UL                            /**< Mode WUCYCLES96 for AMUXCP_TRIM             */
#define _AMUXCP_TRIM_WARMUPTIME_WUCYCLES128     0x00000002UL                            /**< Mode WUCYCLES128 for AMUXCP_TRIM            */
#define _AMUXCP_TRIM_WARMUPTIME_WUCYCLES160     0x00000003UL                            /**< Mode WUCYCLES160 for AMUXCP_TRIM            */
#define AMUXCP_TRIM_WARMUPTIME_DEFAULT          (_AMUXCP_TRIM_WARMUPTIME_DEFAULT << 0)  /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_WARMUPTIME_WUCYCLES72       (_AMUXCP_TRIM_WARMUPTIME_WUCYCLES72 << 0) /**< Shifted mode WUCYCLES72 for AMUXCP_TRIM     */
#define AMUXCP_TRIM_WARMUPTIME_WUCYCLES96       (_AMUXCP_TRIM_WARMUPTIME_WUCYCLES96 << 0) /**< Shifted mode WUCYCLES96 for AMUXCP_TRIM     */
#define AMUXCP_TRIM_WARMUPTIME_WUCYCLES128      (_AMUXCP_TRIM_WARMUPTIME_WUCYCLES128 << 0) /**< Shifted mode WUCYCLES128 for AMUXCP_TRIM    */
#define AMUXCP_TRIM_WARMUPTIME_WUCYCLES160      (_AMUXCP_TRIM_WARMUPTIME_WUCYCLES160 << 0) /**< Shifted mode WUCYCLES160 for AMUXCP_TRIM    */
#define AMUXCP_TRIM_FLOATVDDCPLO                (0x1UL << 2)                            /**< Float VDDCP Low Power                       */
#define _AMUXCP_TRIM_FLOATVDDCPLO_SHIFT         2                                       /**< Shift value for AMUXCP_FLOATVDDCPLO         */
#define _AMUXCP_TRIM_FLOATVDDCPLO_MASK          0x4UL                                   /**< Bit mask for AMUXCP_FLOATVDDCPLO            */
#define _AMUXCP_TRIM_FLOATVDDCPLO_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_FLOATVDDCPLO_DEFAULT        (_AMUXCP_TRIM_FLOATVDDCPLO_DEFAULT << 2) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_FLOATVDDCPHI                (0x1UL << 3)                            /**< Float VDDCP High Power                      */
#define _AMUXCP_TRIM_FLOATVDDCPHI_SHIFT         3                                       /**< Shift value for AMUXCP_FLOATVDDCPHI         */
#define _AMUXCP_TRIM_FLOATVDDCPHI_MASK          0x8UL                                   /**< Bit mask for AMUXCP_FLOATVDDCPHI            */
#define _AMUXCP_TRIM_FLOATVDDCPHI_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_FLOATVDDCPHI_DEFAULT        (_AMUXCP_TRIM_FLOATVDDCPHI_DEFAULT << 3) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_BYPASSDIV2LO                (0x1UL << 4)                            /**< Bypass Div2 Low Power                       */
#define _AMUXCP_TRIM_BYPASSDIV2LO_SHIFT         4                                       /**< Shift value for AMUXCP_BYPASSDIV2LO         */
#define _AMUXCP_TRIM_BYPASSDIV2LO_MASK          0x10UL                                  /**< Bit mask for AMUXCP_BYPASSDIV2LO            */
#define _AMUXCP_TRIM_BYPASSDIV2LO_DEFAULT       0x00000001UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BYPASSDIV2LO_DEFAULT        (_AMUXCP_TRIM_BYPASSDIV2LO_DEFAULT << 4) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_BYPASSDIV2HI                (0x1UL << 5)                            /**< Bypass Div2 High Power                      */
#define _AMUXCP_TRIM_BYPASSDIV2HI_SHIFT         5                                       /**< Shift value for AMUXCP_BYPASSDIV2HI         */
#define _AMUXCP_TRIM_BYPASSDIV2HI_MASK          0x20UL                                  /**< Bit mask for AMUXCP_BYPASSDIV2HI            */
#define _AMUXCP_TRIM_BYPASSDIV2HI_DEFAULT       0x00000001UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BYPASSDIV2HI_DEFAULT        (_AMUXCP_TRIM_BYPASSDIV2HI_DEFAULT << 5) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_BUMP0P5XLO                  (0x1UL << 6)                            /**< Bump 0.5X Low Power                         */
#define _AMUXCP_TRIM_BUMP0P5XLO_SHIFT           6                                       /**< Shift value for AMUXCP_BUMP0P5XLO           */
#define _AMUXCP_TRIM_BUMP0P5XLO_MASK            0x40UL                                  /**< Bit mask for AMUXCP_BUMP0P5XLO              */
#define _AMUXCP_TRIM_BUMP0P5XLO_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BUMP0P5XLO_DEFAULT          (_AMUXCP_TRIM_BUMP0P5XLO_DEFAULT << 6)  /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_BUMP0P5XHI                  (0x1UL << 7)                            /**< Bump 0.5X High Power                        */
#define _AMUXCP_TRIM_BUMP0P5XHI_SHIFT           7                                       /**< Shift value for AMUXCP_BUMP0P5XHI           */
#define _AMUXCP_TRIM_BUMP0P5XHI_MASK            0x80UL                                  /**< Bit mask for AMUXCP_BUMP0P5XHI              */
#define _AMUXCP_TRIM_BUMP0P5XHI_DEFAULT         0x00000001UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BUMP0P5XHI_DEFAULT          (_AMUXCP_TRIM_BUMP0P5XHI_DEFAULT << 7)  /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_BIAS2XLO                    (0x1UL << 8)                            /**< Bias 2x Low Power                           */
#define _AMUXCP_TRIM_BIAS2XLO_SHIFT             8                                       /**< Shift value for AMUXCP_BIAS2XLO             */
#define _AMUXCP_TRIM_BIAS2XLO_MASK              0x100UL                                 /**< Bit mask for AMUXCP_BIAS2XLO                */
#define _AMUXCP_TRIM_BIAS2XLO_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BIAS2XLO_DEFAULT            (_AMUXCP_TRIM_BIAS2XLO_DEFAULT << 8)    /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define AMUXCP_TRIM_BIAS2XHI                    (0x1UL << 9)                            /**< Bias 2x High Power                          */
#define _AMUXCP_TRIM_BIAS2XHI_SHIFT             9                                       /**< Shift value for AMUXCP_BIAS2XHI             */
#define _AMUXCP_TRIM_BIAS2XHI_MASK              0x200UL                                 /**< Bit mask for AMUXCP_BIAS2XHI                */
#define _AMUXCP_TRIM_BIAS2XHI_DEFAULT           0x00000001UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BIAS2XHI_DEFAULT            (_AMUXCP_TRIM_BIAS2XHI_DEFAULT << 9)    /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define _AMUXCP_TRIM_VOLTAGECTRLLO_SHIFT        10                                      /**< Shift value for AMUXCP_VOLTAGECTRLLO        */
#define _AMUXCP_TRIM_VOLTAGECTRLLO_MASK         0xC00UL                                 /**< Bit mask for AMUXCP_VOLTAGECTRLLO           */
#define _AMUXCP_TRIM_VOLTAGECTRLLO_DEFAULT      0x00000002UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_VOLTAGECTRLLO_DEFAULT       (_AMUXCP_TRIM_VOLTAGECTRLLO_DEFAULT << 10) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define _AMUXCP_TRIM_VOLTAGECTRLHI_SHIFT        13                                      /**< Shift value for AMUXCP_VOLTAGECTRLHI        */
#define _AMUXCP_TRIM_VOLTAGECTRLHI_MASK         0x6000UL                                /**< Bit mask for AMUXCP_VOLTAGECTRLHI           */
#define _AMUXCP_TRIM_VOLTAGECTRLHI_DEFAULT      0x00000002UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_VOLTAGECTRLHI_DEFAULT       (_AMUXCP_TRIM_VOLTAGECTRLHI_DEFAULT << 13) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define _AMUXCP_TRIM_BIASCTRLLO_SHIFT           15                                      /**< Shift value for AMUXCP_BIASCTRLLO           */
#define _AMUXCP_TRIM_BIASCTRLLO_MASK            0x38000UL                               /**< Bit mask for AMUXCP_BIASCTRLLO              */
#define _AMUXCP_TRIM_BIASCTRLLO_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BIASCTRLLO_DEFAULT          (_AMUXCP_TRIM_BIASCTRLLO_DEFAULT << 15) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define _AMUXCP_TRIM_BIASCTRLLOCONT_SHIFT       18                                      /**< Shift value for AMUXCP_BIASCTRLLOCONT       */
#define _AMUXCP_TRIM_BIASCTRLLOCONT_MASK        0x1C0000UL                              /**< Bit mask for AMUXCP_BIASCTRLLOCONT          */
#define _AMUXCP_TRIM_BIASCTRLLOCONT_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BIASCTRLLOCONT_DEFAULT      (_AMUXCP_TRIM_BIASCTRLLOCONT_DEFAULT << 18) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define _AMUXCP_TRIM_BIASCTRLHI_SHIFT           21                                      /**< Shift value for AMUXCP_BIASCTRLHI           */
#define _AMUXCP_TRIM_BIASCTRLHI_MASK            0xE00000UL                              /**< Bit mask for AMUXCP_BIASCTRLHI              */
#define _AMUXCP_TRIM_BIASCTRLHI_DEFAULT         0x00000007UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_BIASCTRLHI_DEFAULT          (_AMUXCP_TRIM_BIASCTRLHI_DEFAULT << 21) /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define _AMUXCP_TRIM_PUMPCAPLO_SHIFT            24                                      /**< Shift value for AMUXCP_PUMPCAPLO            */
#define _AMUXCP_TRIM_PUMPCAPLO_MASK             0x7000000UL                             /**< Bit mask for AMUXCP_PUMPCAPLO               */
#define _AMUXCP_TRIM_PUMPCAPLO_DEFAULT          0x00000007UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_PUMPCAPLO_DEFAULT           (_AMUXCP_TRIM_PUMPCAPLO_DEFAULT << 24)  /**< Shifted mode DEFAULT for AMUXCP_TRIM        */
#define _AMUXCP_TRIM_PUMPCAPHI_SHIFT            28                                      /**< Shift value for AMUXCP_PUMPCAPHI            */
#define _AMUXCP_TRIM_PUMPCAPHI_MASK             0x70000000UL                            /**< Bit mask for AMUXCP_PUMPCAPHI               */
#define _AMUXCP_TRIM_PUMPCAPHI_DEFAULT          0x00000007UL                            /**< Mode DEFAULT for AMUXCP_TRIM                */
#define AMUXCP_TRIM_PUMPCAPHI_DEFAULT           (_AMUXCP_TRIM_PUMPCAPHI_DEFAULT << 28)  /**< Shifted mode DEFAULT for AMUXCP_TRIM        */

/** @} End of group EFM32PG28_AMUXCP_BitFields */
/** @} End of group EFM32PG28_AMUXCP */
/** @} End of group Parts */

#endif // EFM32PG28_AMUXCP_H
